{"podcast_details": {"podcast_title": "Rich Dad's StockCast with Andy Tanner", "episode_title": "S2E4 - Investing in Stocks the Rich Dad Way", "episode_image": "https://d3wo5wojvuv7l.cloudfront.net/t_rss_itunes_square_1400/images.spreaker.com/original/90195ca2ec27affe01e2cf7777634d7a.jpg", "episode_transcript": " All right, everybody. Welcome to Rich Dad's Stock Cast with Andy Tanner. We're glad you're here. You know, every show I'll say something like, make sure you put your thoughts in the comments, make sure you subscribe and hit the notification button and all that. But I just, this show is going to show you that we really read those comments and it's going to be about a comment that we've seen over and over and it really does need explaining. It's a very, very valid comment. I'm really glad you guys are actually listening well enough to really think this through. So what we're going to ask Andy Tanner, our wizard today is Andy, Robert right now is talking so much about, he trashes basically stock investing. He's trashing it right now. I think he's even said you're an idiot if you're getting in the stock market right now. And so everyone's wondering how can we have a Rich Dad stock show? It's a legit question. I got to say it's, you know, yeah, common sense says that that needs to be answered. So Andy, how is it that we're having a Rich Dad stock show when Robert Kisaki is saying only idiots are getting the stock market right now? I guess that tells people where I stand. Yeah. Yeah. The real question is Andy, are you an idiot? It's not the first time I've been called an idiot and there might be some truth to it. So be careful. I actually agree with Robert. And I think the reason is I've known him for 15 years. And so I understand what he says because I would say essentially same thing. So you know, we're going to use some clarification because the things that we teach are so different and unique. Well, I don't know if unique, but they're certainly in the minority. So we'll talk. I think it'd be a great opportunity now that you mentioned that comment to talk about several things. We can talk about the different types of real estate investing, the different types of stock investing. What do we mean when we say, boy, stocks can be, you know, really, really crazy and dangerous, but they can be really, really solid. And I think it's a huge opportunity to talk about asset classes and investor classes. And so I think that comment's awesome because it'll make for a great show. And I think you'll get a ton of clarity and also some hope and some excitement about your future in whatever asset class you choose to learn about. All right. Sounds good. I have a question for you. Yeah, extra have more comment. I think the thing that I personally find most dangerous about stock investing is also the thing I like most about it. And that is when you were teaching me the ease of getting into it, like, yeah, right now, get off this zoom and in 10 minutes, I have a brokerage account and I'm invested. I'm, I'm messing my life up, but I'll tell you, you're right on track there. It's the ease of access is a, is a concern. It's also the greatest thing about it. Like I don't have to wait forever to buy a house and all that. And I don't have to have a hundred thousand dollars put down on a house. I can like get into this stock investing right now. Yeah. Let's, let's talk a little bit about, about people that get into stocks. I, in my home country, the United States, the predominant retirement program is something we call a 401k plan. And it's got usually a combination of equities or what we call stocks and a little bit of debt, which is made up of bonds and funds that have stocks and bonds or combination leans mostly towards stocks. You know, bonds are often a little bit better yield with rates higher, but you know, it's, it's an asset class that I often repeat myself. I hope I don't do it too often, but it might bear repeating in saying that there's probably no other asset in the world that has more participation with less education than paper assets. Generally, if someone's going to buy some real estate, they have to have some experience to raise some money or a, you know, you're, you're, you're usually talking seven figures even for a duplex nowadays. And so, you know, there's just a barrier to entry by raising money and using debt. Most people don't know how to do. So you're going to have some level of competency I'd imagine to enter. It doesn't guarantee the person's competent, but you know, anyone when they're 18 can just, it's easy as setting up a savings account. Next thing you know, you can put your money at tremendous risk without a lot of education. So you make a great point because of, of ease of access, but, but I would say this, Greg, you know, if you were to ask me, you know, my opinion on house flipping for most people, that's a tough venture because we're dealing with a price change. And, and this is, if someone really wants to understand, you know, stock investing versus stock trading, perhaps is there's two opportunities. The first opportunity is to buy low, sell high. So when myself, you know, when I decry stocks or if Robert, I won't put words in his mouth, but if he decries stocks, risk is about control. And I have no control over which direction the market goes. I have no control over the price of a stock. I buy it and I, I fold my arms. I'm going to have to watch what happens because there's very little control, none at all, really. And that is an issue with a 401k because there's not a lot of control there. And that's an issue. And so when, when Robert and I say, boy, you know, stocks for a lot of people, that's just nutty. Or if I say, you know, throw your money in the stock market right now, we're really speaking the language of Jim Kramer and, you know, CNBC. And if you turn on CNBC, 90 plus percent of the conversation is about that price. And that is, that is capital gain investing. So sometimes, you know, you can call it a tissue and you can call it a Kleenex and people kind of figures the same thing. Kleenex might make other, other products. I don't know if they do, but when you say stocks, you're generally having a broad sense of people that put their money in and hope it goes up. I think many listeners believe that that stock, stock in stock investing, it's really stock trading. Okay. Yeah. That is, you mentioned both. Can you just explain the difference between stock investing and trading? Gladly. Gladly. If, if you were to be on Mars, look down on Mars and you looked at, you know, a real estate investment, you'd have a business entity. You'd have a product that serves people, housing, and you have a customer. So a business with a product and a customer and the way that the money's intended to be made is to rent the house and fulfill a customer's need. A great way to begin this conversation, to really understand it is with the, the tale of the goose that laid the golden eggs. So let's say there was a goose and it could lay eggs of gold. Would you buy that goose because you were hoping the price of the goose was going to go up later on in the year, or is your motivation to buy the goose because of the production of the goose, you know, as a, as a money machine and almost no one would say, Hmm, I think I'm going to buy this golden goose because I speculate the price of these geese will be higher because you would lose your asset that produces the thing that's really valuable. And so, you know, when, when we look at real estate, if you were to ask Robert, what do you think about constantly flipping houses? If that's your talent, I don't have anything against if, if you can get to heaven that way, that's fabulous. We'll talk a little bit about, you know, dogmatism and how you think that way. But, but for, for us, we believe in cash flow. It's just what we believe in is that when you put money and buy an asset, that asset stays in the asset column and you know, house goes up, down, whatever it, we don't care about the price of the house. We don't care about the price of the stock. We don't care about the price of the goose. It's the production of the cash flow we care about. So it's a very important distinction to make, I think, you know, the book that I, that I wrote years ago is called stock market cash flow, where our, our focus is on owning a business. So if I had a piece of paper called a deed and I had a piece of paper called a stock certificate, both of those simply certify ownership. You know, if we want to go back to caveman days, you know, I can get my club and say, this is my cave and defend it with my club. That's called primal. But if we live in a civilized society, I say, no, this is my cave because I have a deed. I own, you know, a certain part of this apartment building as a syndication. You know, I have documents to certify ownership. You know, maybe it's a 300 unit apartment building and I own 30 units. And this shows my share of that apartment building. Well, the same is true as stock. And I fail to see much of a difference from on Mars is if someone's building these, these are real. You know, if I, if I took your phone and I broke it, you'd be upset. If I threw it in the ocean, you'd be upset. Why? Cause it's real. The money you pay for it is real. The money you give Verizon and AT&T is very, very real. So when I invest, I am a business owner. I love dividends from my light on. I love the dividend because in real estate you get a distribution of the rent among the owners. You gotta stop. You use the word invest there. So investing is the golden goose where you collect the eggs. Trading is when you buy the golden goose, hoping to swap out the goose. You're trading the goose, right? You're trading the goose. Yeah. Stock investing is cashflow stock trading is capital gains. Yeah. And, and here's an important thing. What is the stock market? This is really important. Warren Buffett does not really participate much in the stock market because the market is the buying and selling of the goose, right? Back and forth. It's a market for stocks. Uh, I don't participate in the stock market very much because once I buy a stock, if as long, the only reason I would go back to market with my goose is if it stopped laying eggs. If the goose stopped laying eggs, I might say, anyone want to buy this goose for dinner because it's not laying any eggs. And I'd go back to the market and sell my goose. But for me, I look at it much like Warren Buffett does as a business owner. If you listen to him, he doesn't really talk about the stock market much. He doesn't play the stock market. He doesn't really participate in the stock market. He does own businesses and he does, you know, Berkshire Hathaway is what the fourth largest business in the world. Um, he does own businesses. So if you were to take fruit of the loom, which isn't traded on the stock market, he owns all of it. If you were to take Dairy Queen, which isn't on the stock market, he owns all of it. Seas, Candies, RC Willie, Geico insurance, Duracell batteries. These are companies he owns that are not for sale. He doesn't trade them on the stock market. Now, Apple, he also owns, he doesn't own the whole thing. And if he wanted to trade it back and forth, he could, but he doesn't. And same with Kraft Heinz and, and, uh, you know, you could go through Chevron, American express, Moody's, uh, he bought some snowflake. He bought, uh, he's got a few dozen companies he owns, but most of his money is probably in the top eight. Uh, so he doesn't, you know, move a lot of money around based on the price. If he doesn't wake up in the morning and say, I wonder what I could sell fruit of the loom for today. Uh, I wonder what I could sell Seas Candies for today. When he sells a business, it's because the business is no longer producing cashflow. So when I say, I think it's crazy to play around in the stock market. I really agree with Robert because trying to buy low and sell high all the time is, is really difficult unless you're very astute and, and now, you know, AI does a lot of that and that type of thing. But what I feel really grounded and rooted regardless of where technology goes or cryptocurrencies go or whatever, if I have food, clothing, shelter, medicine, and really important now, technology and communication and energy, food, clothing, shelter, you need energy, you need communication, you need medicine. And so if I can participate in shelter through real estate, if I can participate in energy through ExxonMobil, if I can participate in, in communications, uh, through Apple, if I can participate in Kraft Heinz food, I get to be a part of business where I receive money for people that buy these things, not trying to buy low and sell high all the time. So that's one real important distinction. So I don't know if that was clear or not, but most people don't, wouldn't look, you wouldn't look at it at Warren Buffett as a stock market trader. I wouldn't look at myself as a stock market trader. And I don't even really care for the term. I mean, what if I, what if I labeled real estate people, which I'm in that market too. Well, I'm a deed guy. I'm really into deeds, right? I'm into deeds. You know, that's kind of what stocks are. They're shares, they're pieces of paper, but behind that is ownership. So does that help? I don't know if that helped. No, no, no, it does. I'm going to cut you off because we're going to go to break. And when we come back, I'm going to do something that you hate. I'm going to speak for Robert Kiyosaki because I know you will do it. And then what I want you to do is tell me if I, if I understood Robert's point of view, as far as you know, and then maybe help clarify it just a little bit when we get back. All right, I'll do my best. All right. Thank you. All right, everybody. Welcome back to the show. This is Robert Kiyosaki here with Andy Tanner. I was kidding, but I am going to speak for Robert Kiyosaki. I'm going to say you got, you're, you're, you're got, you're got more courage than I do. Yeah. Yeah. I really hope that he doesn't see this, but I'm going to say Andy Tanner right now, the stock market is bloated. Everybody's rushing in to get into the stock market because Jim Kramer is telling him to, and I am so afraid that people are going to get burned. And I'm so afraid people are going to use their 401ks and think that they're retiring and think that they're set that I'm so afraid of these two things that I'm going to tell everyone I know not to get in the stock market. But for those who are financially educated, I'm going to say don't trade in the stock market, invest in the stock market, but only if you're educated. How do you feel today? Did it pull it off? I, I, I don't know if I, I want to put words to mouth, but I agree with everything you said. Percent I said it louder and with more wisdom and all that. More gusto. Yeah. That's that here. Here's the thing again, if I were to sit down with someone that was confused on this, the first thing I would talk about is the difference between capital gain and cashflow. Capital gains are reliant on prices to move a 401k. People look at, uh, it's a function of a balance sheet, right? And my assets, I'm a lot of billions. That's how much I've left. It's an hourglass. If I spend that money and I'm reliant on a big stockpile of cash, that cash will shrink in my retirement days or on the mean, the median balance in the U S at least according to Vanguard, it's about $71,000 for someone ages 55 to 65. Again, we're looking at a number, we're looking at an amount, we're looking at the price of his stocks added up as opposed to concentrating on how much money does that $71,000 a year generate? If that's $71,000 generated a hundred, he'd be fine. Great. Wait, are you trying to tell me that the average 401k for people about to retire is 71,000? They're going to have $71,000 to live the rest of the life that the average is the average a little higher than that. I mean, the mean, the guy in the middle, that means that Vanguard, half the people have less than 71 in that age group, half the people have more. So it's a mean, it's a better average gets skewed a little towards the top because you've got rich, you know, zillionaire executives pulling that up, but the guy in the middle. Yeah. So again, I could, you know, I want to be as clear as I possibly could here in that it is not a function of your balance sheet. That's a net worth issue. The cash flow game, the, you know, his original company's cashflow technologies, the, you know, Kim is be queen of cash flow. It is the financial statement. You look at the income and expense, what is coming in, not the price of the goose, the golden eggs. Now, if I could add another thing here that I'm passionate about, clearly you can tell, should I do an ant? You know, we have a, oh, I feel one coming on, man. It's rough. I refuse to, to allow my success to be defined by asset class. People are so far off on saying, well, this is a good asset class is a bad asset class. Your success. If you get closer to your investing goals and if you find yourself moving closer toward them, do you really think that's going to be a function of anything other than your dedication to discipline, temperament, and education? Look, I will never bash another asset class. I won't bash them because here's the thing. If I want to bash real estate, I've got to go to Kenny McElroy or fan Merrill or Kim Kiyosaki or Robert. I got to knock on their door. I got to say, you're an idiot. You know, cause real estate, you're going to be fixing the toilet and you know, they're going to bake crystal meth in the basement and there's debt and it's too much risk and blah, blah, blah. I can't say it because those guys are wonderfully successful. So obviously you have people in real estate who have lost their behind and people who have become tremendously wealthy using debt, you know, using tax advantages. I see the difference between people who fail in real estate and people who are successful in it as a function of the education, discipline, and temperament of the investor, not because the asset class blessed them or didn't. If I bash energy, I got to go to the late T. Boone Pickens and his family and say, what a moron. You know, what is, I wouldn't, he's a brilliant investor. If I want to bash stocks in terms of business ownership, I have to go to the greatest investor of our time, not the greatest entrepreneur. He never started his own company. That'll go to guys like jobs. That'll go to guys like Bezos. That'll go guys like Musk. Buffett simply buys these guys companies. He's an investor. He owns companies and he makes billions of spendable cash. I can't knock on his door and call him an idiot, but I can find people who play the market without education, with a poor temperament. To me, there's a book called the Intelligent Investor by Benjamin Graham. And it's really a book on education temperament, really more than securities analysis. That's a different book. And, and when you find a person who's an idiot, it's usually because their temperament is out of whack or they're ignorant in what they're doing. You know, that sounds more like an idiot to me, someone who is not educated and someone who lacks the temperament and toughness for investing. That sounds like an idiot to me. So if I could say it's not about anyone that says this asset class is good. This class is bad. I disagree with that vehemently because I can find investors that have found success in one asset class and failures in the same asset class. It's usually a function of who's doing the investing more than the investment itself. So we've got two good points. You triggered a thought there. It's something else that Robert always says. But before I get to that, you also mentioned a book that you read and I want to let people know there is a free book offer. I think it's in the description. Oh, it's on the screen right now. This is a book Andy Tanner wrote. So I highly recommend it. It's free. Just click on the link, download it. Thank you for the plug. So maybe that's the book you should be talking about. Ding dong. Well, sorry, but Robert Keesak, I want to get back to him because really this is to help, I guess, help ease people that were not in any way bashing Robert or even talking bad about him because we're actually just trying to clarify some of the statements made because they are so big and broad because so many people listen that you kind of have to be. But you mentioned different asset classes. And one of the things Robert hates and constantly rails on is the word diversification. Because most people talk about that word as it relates to the stock market. Can you just kind of go into that and then go into what you were just talking about with an asset classes? Yeah, first of all, diversification, Buffett said it perhaps best. He said it's a you know, it's really an answer to ignorance. You know, if I if I know why would I want to be average? If I say look, these are the five best if I was a doctor, and I took everyone's vital signs in a room of 1000 people and all of I did an analysis on them, BMI, cholesterol, you know, all that blood pressure. And I said, Okay, I'm gonna pick 10 people for the marathon. I'm not gonna say well, everyone run it and I'll average it out. You're gonna pick your best horses. diversification doesn't address systemic risk. We do a whole show on diversification if you want it. But I agree 100% the reason Robert and I first became friends is probably 17 years ago 16 years ago, something like that. You know, he had heard my name somewhere and he invited me to one of his events and they actually let me get get on the stage and speak. And I just destroyed 401k so I just just annihilate him. I went through everything that sucked about him. He's like, Okay, this this is the same way I feel. Because those are a function of the balance sheet and price which you can't control is supposed to cash flow which can. Now I would also say this, an investor, like I like real estate, and I wish I had more of it. An investor finds the thing that they're comfortable with and good at. And Kim is just master she just understands it well, right. And I've had I've, you know, I remember I was in Peru, I think it was either Peru or, yeah, or Chile, it was Chile, we were in Chile. And we were I was in the airport with Robert, we waiting for our plane and we were talking about Petro Brazil, which is a, you know, the brothers there, the the cartel, a lot of corruption, you know, and that company had uncovered some corruption stockpiles is really low. So he put me, I think he put me on the phone actually with this guy, if I remember right, with his broker. And I said, Hey, let's, let's do this and this and Robert had bought some leaps on it and some options. So yeah, he's dabbled in it. But it's not his thing. It's not, you know, it's very fast to get into it. It's not his style. And he loves the debt. Now. Stocks don't use a lot of debt, they use options for leverage. I would not trade stocks or invest in stocks either one, if I didn't have the options market. The dividends to this show, it's also the key to way the way you look at stocks. Yeah, I wouldn't throw my money in the stock. Would not throw my money in the stock market if I didn't understand options. I would not for two reasons. Number one, protection. That's what they're designed for. Number two, that supplements the ability to sell an option supplements my cash flow. And the dividends by themselves, you know, aren't always as competitive as you'd like them to be. So by adding cash flow, right, monthly cash flow, I've got stocks. I show my students all the time that I've had that are just kind of done their thing. A good example would be ExxonMobil. Now I've made a lot of money on that. On paper, I'm not going to sell it because I bought it coming out of COVID. And I talk a lot about it because if you look at their dividend, it's the cash flow. They have either maintained or raised their dividend every time they've given a dividend. It's been the same or higher for like 37 years in a row. I mean, that's an incredible record. You know, a company like Dow Chemical, you know, they're going to pay 70 cents per share on every quarter. You know, whatever that is, $2.80 a year. That hasn't changed. I mean, it's just solid, right? Solid. So I don't like the ups and downs. So I have to agree as I would not play the stock market. I think throwing your money in there and hoping it goes higher. If you're putting your money in the market, hoping it goes higher, I disagree with what you're doing. I think it's a cash flow issue. I think your expenses are answered either by cash flow assets or debt or income assets or debt. I think income is the best way to offset expenses. It's a function of the income statement, not the balance sheet. That I would argue with a lot, but I wouldn't argue about asset classes. If a guy makes a ton of money in Bitcoin, heaven bless him. If a guy makes a ton of money in oil, heaven bless him. I have nothing but love for people that do well in their asset class. So hopefully that's- Sorry. So I think there's two or three points if I could summarize. The first thing I would say is that it's not about asset class. It's about investor. The second thing I would say it's not about capital gain. It's about cash flow. And the third thing I would say it's about finding out what you're good at. Musk, Cuban entrepreneurs, Buffett, investor. You know, Buffett, investor. Find out what you're good at. You know, read books, go to webinars, do stuff like that. And then if you can develop cash flow throughout your life, then you get to elevate your financial wellbeing through your education. And I would add your learning about temperament is an important thing. So hopefully that wasn't a crazy rant. No, no, no. You're good. So we didn't really discuss how to cash flow stocks in this show, but that's another reason to download the book. Excuse me. Just so because in that book you do address how to cash flow stocks. And so make sure you download that book that's in the description. I did want to just summarize with the diversification. Most people mean buy different stocks in different categories, like buy some of the tech, buy some, and I don't even know what else there is. Your food. Well, there's sectors is what, yeah, there's sectors, cyclicals, energy, financials. Yeah. But the diversification Robert likes is the same thing as you. Like Robert's a little bit in stocks here a lot. You're both into real estate. You're both entrepreneurs. And so I think that's the real key to how when Robert uses the word diversification and he's trash. That's, that's what he's saying. Yeah. We could do a show on this. An asset has a purpose and you can either invest for cash flow. You can also do what's called a hedge. I buy things sometimes like insurance. You've bought insurance in your life, right? And when you buy insurance, you're not usually looking to profit, particularly car insurance, home insurance, but that is an investment to protect the other investment. So when you invest, you want to understand it. I'm investing for capital gain, cash flow, or a hedge or the three most popular. And that comes with a financial education. And if someone doesn't want to buy, and I don't ever advocate for an asset class. If someone says, look, I don't like stocks, I say, well, it doesn't bother me. It doesn't affect my cash flow. If someone else doesn't like stocks, you know, I still get my dividends. So what do I care what people say? Right? To me, it's more of a, like, if you know, there's house flippers who are trying to buy a house, low and sell high, and they're stock traders, buy low, sell high. There's real estate investors that want to have a business that provides a service called housing, and they collect money from that customer called a distribution. And then you have investors in stocks that collect money from customers, you know, profits, earnings. It's just called a dividend. So you can distribute it to the owners or you can divide amongst the owners. To me, it's the same thing. All right. Well, hey, Andy, we're going to wrap up. All you people, all everyone in the audience, I want to make sure you heard that Andy said Robert Kisaki absolutely loves the stock market. I'm totally kidding. But I do hope we got a little clarity because that was concerning to the audience. And please leave more questions in the comments. We'd love to do shows based on what you're looking for. So please hit subscribe, comments, and we'll see you next week. Hopefully, hopefully people don't look at things dogmatically. Steve Jobs is my favorite quote. Don't be trapped by dogma. Well, this is what I believe in this how it is. I really hope this show helped people in those three ways. Okay, not. It's not capital gain. It's cash flow. It's not the investment is the invest store and find what you like. If you got those three things, then then hopefully you got some value from watching. So thank you. Great. Thanks, Andy. We'll see you next week and everybody download Andy's book and get a little taste of how to cash flow the stock market. Thanks, Eddie. This podcast is a presentation of Rich Dad Media Network."}, "podcast_summary": "In this podcast, Andy Tanner discusses the difference between stock investing and trading. He explains that stock investing is focused on cash flow and owning businesses, while stock trading is focused on capital gains and buying and selling stocks. He agrees with Robert Kiyosaki's view that the stock market can be risky and that most people don't have the education or temperament for successful stock trading. He emphasizes the importance of understanding asset classes and finding what works best for each individual investor. He also addresses the concept of diversification and how it should be viewed as investing in different asset classes rather than just buying different stocks. Overall, the podcast aims to clarify some common misconceptions about stock investing and trading, and highlights the importance of education, discipline, and temperament in successful investing.", "podcast_guest": "Andy Tanner", "podcast_highlights": "- Stocks and stock trading are different from stock investing\n- Stock trading relies on buying low and selling high, while stock investing focuses on cash flow\n- Cash flow from stocks comes in the form of dividends\n- Warren Buffett is an example of a stock investor who focuses on owning businesses\n- Diversification should be about investing in what you're good at, not just buying different stocks in different sectors\n- Success in investing is more about education, discipline, temperament, and finding your niche rather than the asset class itself."}