{"podcast_details": {"podcast_title": "Business Daily", "episode_title": "Picture perfect cakes and cafes", "episode_image": "http://ichef.bbci.co.uk/images/ic/3000x3000/p09r4c3q.jpg", "episode_transcript": " Hello and welcome to Business Daily from the BBC World Service, the business podcast which brings you the trends, the money and the people who make the world and its money go round. Podcasts from the BBC World Service are supported by advertising. Welcome to Business Daily. I want to talk about one of my favourite things in the world, cake. Cover it in a crumb coat and then pipe all the colours on. Now am I good enough at macarons to be experimenting with them? Absolutely not. Here's how to make mini chocolate chip cookies in just 10 minutes. Whisk together melted butter, light brown sugar, Roll into a croissant formation and cover in egg wash. Dash in the oven, pull them apart and just look at the choco goodness. When I was growing up in Birmingham in the UK, buying cake meant going down to the local high street, choosing something, maybe a vanilla slice or a lovely gulab jamun. Recently however, I've noticed more cakes and bakeries in my local area and on my social media feeds and they have elevated cake to a whole new level. The pistachio, a very trending flavour, filled with chantilly cream and pistachio variegato, pistachio outside and a crispy sablé on top. It's absolutely crucial now to make sure cakes look amazing and the setting they served in is often just as important. On every table you see the food because the food is the only thing that has the light, the colour. So we have like this famous huge macaron that's chocolate macaron with raspberries. It takes charge on the table because it's the only thing that's with colour. I'm Em Hashmi, welcome to the world of picture perfect cakes and cafes. Let's start with a little history lesson. Where did cake actually come from? Jessica Reed is a cafe historian based in the US. Historians generally agree that cake originated in the ancient world as bread like dough sweetened with honey. The word cake shows up in the middle ages and was derived from the old Norse word kaka, spelled K-A-K-A. Cakes as we know them today came about beginning in the mid 17th century with advancements in oven technology and the availability of sugar. Later developments such as baking soda and powder, finely refined flour and things such as electric mixers and reliable refrigeration technology all went into the advancement of cake baking. As for why cakes came to be, they've always been linked to celebrations. Up until recent history the ingredients called for were prohibitively expensive and baking cake was a labour intensive affair, therefore saved for special occasions. Bake goods are a little like fashion in that trends come and go only to return again. Hyper realistic cakes will probably be popular for the foreseeable future, though I certainly can't say that this fad will live forever. I for one am a lover of this simple humble cake. We've come a long way since the day of bread and honey. In this episode of Business Daily I'm going to find out what's driving us to spend more of our cash on outlandish cakes and desserts and delve into the trends that are driving a boom in the artisan bakery and dessert cafe industry. According to London based data company Kantar, retailers in the UK have seen changes in cake and dessert buying habits. One supermarket chain saw sales of sweet treats increase and dubbed the trend the pudding effect. Another trend the data showed is that fewer people now order dessert at the end of a big meal. Instead they treat cakes and desserts as a single indulgent snack bought for a specialist retailer often later in the evening. One such specialist retailer is Donatellia in London. So I am in the heart of the West End in Leicester Square right outside Donatellia. It's busy, it's hot and I am looking at a lot of very pretty donuts from the window. Hello, hello, my name is Arik. Welcome to Donatellia by Roladin. With me is Ronnie, the shop manager. Hello. As you can see here our display of the donuts and our great great pastries that are being made freshly every day. The collection itself is 12 donuts in a row. We change it by season. Most popular one must be the pistachio, a very trending flavor filled with chantilly cream and pistachio variegato, pistachio outside and a crispy sablé on top. And we have also obviously strawberry cream croissant and we have pistachio raspberry croissant. So it's kind of patisserie but really really luxury, handmade artisan. So what you see here is a magic world of donuts. People are queuing all day long. Yes, I basically saw you on TikTok and I saw queues of people outside and I can see the pictures that the people take of all of these. I mean there's so many colors here and there's so much variety. Do you make these in-house every day? Yes, basically all the ingredients made in the same day from the flour till the donuts itself. And we are trying to catch the eye, the taste and the people with the flavor. So I can see people decorating your donuts. Shall we go and have a look? Yes, just to explain to the listeners we are going outside of the shop. We have two large windows that we can see the decoration team is doing the decoration. Everything is fresh. The small almonds, sablés, the biscuits, the meringues are baked in-house to decorate the donuts. It's all handmade as I can see. Exactly. Even those meringues we are doing by ourselves. I want to see where these are actually made. Can I go to the kitchen? Yes. Oh I can smell the donuts and the baking. You can see here all these ingredients that I told you especially for us. These are the boxes that you use. The right one. All the way. Hello. Diego. Are you one of the magic chefs? He's the pastry chef. You're the pastry chef. So no pressure then that your donuts are viral and then everyone, anything that you produce is what people are queuing up for outside. How does that make you feel? I'm very happy. Actually when I go upstairs and I see people outside on the window, inside the shopping, how they look and how they express themselves. And you produce them. Yeah I see. I'm proud of that. I'm proud to make some people happy. So as you can see we are doing the dough. We do three rounds of bake and no more than three, four hours on display. So all the idea is that once you bite it, you enjoy it. Let's go to our baking area. The baking area is really amazing. Our panna chocolate before baking, after proving, you can see the great elimination. It's just about to go into the oven. Natalia here will spray it with egg wash and then the perfect result will come out. They are very big. Very, very hot. And just very crispy. Oh I can hear the crisp. Can you hear the crisp? Wow. So now we're going back to the shop floor. We're going to go up and I'm going to show you how we fry the donuts. Oh you fry them on the shop floor? Obviously. It's the smell you smelled before. Ah I see, I see. So here you have banderas. Are you the chief donut fryer? This is my kingdom. You can see the end result. Golden brown crispy. This is before they've been jazzed up with all the different flavors. This is the humble donut. The humble ones but not a regular donut. So but what makes yours different from the average donuts? We can't tell the secret of the recipe right? You have a secret recipe. We have a secret recipe for fluffy donut, much more airy. I can assure you that it's not oily as the other donuts. I can assure you that the flavors themselves, they are natural. And the combination with the filling and with the glazing is amazing. The definition of a donut is sweetened dough shaped into a ball, ordering and deep fried. Donatellia have been making them in some form or another for the past three decades. And are a very well established brand. I also wanted to talk to someone much newer to the industry. One of the many small businesses trying to break into the market. Hello. Hiya, my name is Wengie. I'm the owner and founder of Treats Club Dessert Bar. And I'm here making donuts for Taste of London. It's been super busy today. It's busy yesterday which is really good. So yeah, we've had a lot of fun and it's only going to get busier as the weekend goes on. And how many donuts are you making here? So roughly about a thousand a day is the plan. So yeah, lots of donuts all made by hand. And what makes your donuts so special? Well, we cook them all fresh and they're all made literally by hand by us. All the fillings, toppings, the dough, everything. And I can see the very colourful donuts in front of me. So I've got six flavours. There's strawberry white chocolate, cookies and cream. There's chocolate filled and also got peanut butter. There's loads of different flavours. Lemon you see. I think people just love the fact that we do different flavours to everyone else. And is it a good profit margin in donuts? Yes, very. We find that most people come to us because it's something you can enjoy with family and friends. Doesn't matter what age, anyone can enjoy a donut. I can't leave Treats Club without actually trying these delights. So here goes. I picked a rich chocolate one. It's very fresh and it's very gooey. Mmm. Actually it's not as sweet as I thought which is really good. The flavours are really balanced. I can understand why there's a queue here. Oh, I think I might be back. As you may have guessed, I am in no way immune to cake. But I should admit I am also very partial to a good picture for socials. A couple of years ago, I queued up in London in the rain for four long hours to get a photo in a cafe of a flower wall. And I am definitely not alone. In the past decade, dessert cafes have really taken off in the UK. Franchise Dessert Cafes Creams now has 100 outlets in the UK. And another operator, Casper's, expanded from 14 stores in 2015 to more than 100 locations now. Social media is undoubtedly a huge platform for cafes and dessert houses to showcase their quirky cakes and interiors. The Dessert hashtag has more than 50 million postings on Instagram. Dubai's Forever Rose Cafe is definitely aimed at the Instagrammers. On every table you see the food because the food is the only thing that has the light, the colour. So we have this famous huge macaron that's chocolate macaron with raspberries. So it takes charge on the table because it's the only thing that's with colour. The budget didn't stretch to a flight, but a quick internet search and you can see why this cafe is so popular on its customers' social media accounts. All the surfaces look like they have been drawn or illustrated. The owner of the cafe, Abraham Al-Samadi, is himself an influencer, boasting more than 600,000 followers on his socials. I was never an influencer and I was never a cafe owner in the beginning. I was always an entrepreneur. What is it about your cafe that makes you stand out from all the other cafes in the UAE? Because I'm the owner. No, it's because it's the first 2D and 3D illustrated cafe in our region. The concept is quite popular in Japan and Korea, but it was never exposed in the Middle East. So we were the first. So always the things that happen first here always get to be famous and always get to be lucky to always get those first clients wanting to have the experience. Now, tell me, if I walk into your cafe, what is the first thing I will see? The first thing you're going to feel is like, wait, where am I? You really feel like you're in a book because everything is white, the same shade of white, which is very hard to do. That's one of our secrets and it's one of our trade secrets. We also have a selection of different flavoured milk cakes. Milk cake is usually made in vanilla, but we did crazy things like, you know, mango milk cake and tiramisu milk cake and strawberry, pistachio, saffron, different flavours that you'll only find in our region. Like, it's not very popular. You'll go to someone in England and find a saffron milk cake. What is the most popular thing on your menu? Our French toast creme brulee. So what we did is we took the technique of creme brulee by crusting the top surface of the French toast with a sugar coating that is burned and caramelised. The fluffiness of the brioche bread that we use is unique. Customers love it. We want that specialness. I think that a lot of companies lose that. You know, we don't, we're not competing with Starbucks or La De Ré or any other company. We want to create our own identity, our own place, that where you can feel like it's your cafe. Let's talk about the business element of this. Is it expensive to set up your own cafe, especially with your own concept? And is it profitable? Profitable for sure. I also won't be having my Blink lifestyle. It's great. All the profit comes from coffee. So, for example, a cost for a company to make a cup of coffee is literally like less than a pound. And, you know, sometimes you can get them as far as five and six pounds. So there's a huge profit margin when it comes to the drinks. There's less profit margin when it comes to the food. But if you calculate things correctly and you use the same ingredients in different elements, you have less waste. It's basically mastering the technique of it in order for you to come out not having any loss and more profit. And is this going to be a franchise now? Are we going to see the Rose Cafe popping up everywhere? Yes, I will give you an exclusive information. Literally just happened last week. We sold three franchises to Saudi Arabia. We are going to be popping up around the world. Part of the popularity of these dessert cafes globally is due to young people consuming less alcohol and looking for places to go out with different offerings to pubs and nightclubs. And in majority Muslim countries, these cafes provide young people with places to go and meet one another in the evening. As such, they have become a bit of a dating hotspot. Here's Abraham Al-Samadi again. I'm sorry, because people are shy to talk to each other because it's not normal for you to kind of flirt with another fellow Arab. So basically, they use this thing, AirDrop, to AirDrop each other's Snap codes. And then you go to Snapchat and then you start talking like, you know, how old are you or whatever you are, because you know, these dating applications are banned in DOE. So this is the form is AirDrop. And people like a lot of foreigners, when they come here and they go into a cafe and they suddenly getting AirDrop from random people, they're like, what the hell is going on? You know? But this is the culture here. This is what happens. A lot of people don't talk about it because, you know, it's kind of a little bit taboo. OK. And is there a special story from maybe a family or a celebration? We had a wedding in our cafe. We had engagement. Oh, did you? Tell me about the wedding. Yes. So we had a wedding. Some people are just in love with ambiance. They love the black and white. They had a wedding. We had 50 people. And then what was amazing is that after the wedding, the lady, she got pregnant literally like eight months after the wedding. And she insisted to do her baby shower in her cafe. Also, you're becoming part of people's lives. And I'm just thinking about how can I change design because I know people get bored of the same design. So I'm trying to think about at the moment, what can I do different than design without changing the element of black and white? So we're working on that. It's very important to give our clients basically a new edge every time. He's not exaggerating there. I managed to catch up with someone who actually got engaged in the cafe. Hello, my name is Tala Al-Masri and I'd like to take you through a quick trip back to my unforgettable engagement. Picture this. You're walking right into a comic strip. Everything's drawn out in 2D. And the moment I stepped in, it was a no brainer. This was the place to get engaged. And let me tell you, I am a huge, huge fan of colors. So the stark black and white background of the cafe was our canvas. And we painted our love story with our iconic roses. So it was just black and white background with pops of color that matches my dress. It was literally like I was living my own romantic fairy tale. Those pictures that I took at the cafe are pictures that are going to last a lifetime. That brings us to the end of this episode of Business Daily on the current trend of aesthetically appealing cakes and cafes and why they are big business. I'm M Hashmi. Thanks for listening. I'm off to eat some very pretty cakes."}, "podcast_summary": "The podcast episode you listened to was about the trend of aesthetically appealing cakes and cafes and why they are big business. The host explored the history of cakes, how they have become linked to celebrations, and the advancements in baking technology that have led to the popularity of cake baking. The episode also discussed the changes in cake and dessert buying habits, such as people treating cakes and desserts as indulgent snacks rather than ordering them after a meal. The host visited two dessert cafes, Donatellia in London and Treats Club Dessert Bar, and spoke to the owners about their businesses. Both cafes emphasized the importance of freshness and unique flavors in their products. The episode also touched on the role of social media in promoting dessert cafes and the rise of dessert cafes as dating hotspots. The host interviewed the owner of Forever Rose Cafe in Dubai, who discussed the cafe's unique 2D and 3D illustrated interior and the popularity of the French toast creme brulee. The episode also mentioned the profitability of dessert cafes and the potential for franchising. Overall, the episode highlighted the growing trend of picture-perfect cakes and cafes and the factors driving their success.", "podcast_guest": "Jessica Reed", "podcast_highlights": "- Cake has evolved to become more visually appealing\n- Trends in the cake industry include hyper-realistic cakes and aesthetically pleasing desserts\n- Dessert cafes and bakeries are booming in the UK and globally\n- Social media plays a significant role in promoting cake and dessert businesses\n- Donatellia in London and Treats Club Dessert Bar are examples of successful dessert shops\n- Dessert cafes offer unique experiences and attract customers with their visually appealing desserts\n- Profit margins can be high in the dessert industry, especially for drinks like coffee\n- Dessert cafes have become popular dating hotspots in majority Muslim countries\n- The aesthetics and ambiance of dessert cafes make them popular for celebrations and events"}